## Adding and Removing  ( Rows and Columns )

### Columns

In [1]:
import pandas as pd

In [2]:
people = {
    'first': ['Ali','Talha','Taha'],
    'last': ['Haider','Ahmad', 'Ahmad'],
    'email': ['AliHaider@gmail.com','TalhaAhmad@gmail.com', 'TahaAhmad@gmail.com']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first    last                 email
0    Ali  Haider   AliHaider@gmail.com
1  Talha   Ahmad  TalhaAhmad@gmail.com
2   Taha   Ahmad   TahaAhmad@gmail.com

In [5]:
df['first']+' '+df['last']

0     Ali Haider
1    Talha Ahmad
2     Taha Ahmad
dtype: object

In [6]:
df['full_name'] = df['first']+' '+df['last']

In [7]:
df

   first    last                 email    full_name
0    Ali  Haider   AliHaider@gmail.com   Ali Haider
1  Talha   Ahmad  TalhaAhmad@gmail.com  Talha Ahmad
2   Taha   Ahmad   TahaAhmad@gmail.com   Taha Ahmad

In [8]:
df.drop(columns=['first','last'])

                  email    full_name
0   AliHaider@gmail.com   Ali Haider
1  TalhaAhmad@gmail.com  Talha Ahmad
2   TahaAhmad@gmail.com   Taha Ahmad

In [9]:
df

   first    last                 email    full_name
0    Ali  Haider   AliHaider@gmail.com   Ali Haider
1  Talha   Ahmad  TalhaAhmad@gmail.com  Talha Ahmad
2   Taha   Ahmad   TahaAhmad@gmail.com   Taha Ahmad

In [10]:
df.drop(columns=['first','last'], inplace=True)

In [11]:
df

                  email    full_name
0   AliHaider@gmail.com   Ali Haider
1  TalhaAhmad@gmail.com  Talha Ahmad
2   TahaAhmad@gmail.com   Taha Ahmad

In [14]:
df['full_name'].str.split(' ',expand=True)

       0       1
0    Ali  Haider
1  Talha   Ahmad
2   Taha   Ahmad

In [15]:
df[['first', 'last']] = df['full_name'].str.split(' ',expand=True)

In [16]:
df

                  email    full_name  first    last
0   AliHaider@gmail.com   Ali Haider    Ali  Haider
1  TalhaAhmad@gmail.com  Talha Ahmad  Talha   Ahmad
2   TahaAhmad@gmail.com   Taha Ahmad   Taha   Ahmad

### Rows

In [19]:
# Adding a single row to the dataframe we use append method...

df.append({'first':'Wahaj', 'last':'Muhammad', 'email':'WahajMuhammad@gmail.com','full_name':'Wahaj Muhammad'}, ignore_index=True)

                     email       full_name  first      last
0      AliHaider@gmail.com      Ali Haider    Ali    Haider
1     TalhaAhmad@gmail.com     Talha Ahmad  Talha     Ahmad
2      TahaAhmad@gmail.com      Taha Ahmad   Taha     Ahmad
3  WahajMuhammad@gmail.com  Wahaj Muhammad  Wahaj  Muhammad

In [20]:
people = {
    'first': ['Abdul','Muhammad'],
    'last': ['Rehman','Atif'],
    'email': ['AbdulRehman@gmail.com','MuhammadAtif@gmail.com',]
}

In [21]:
df2 = pd.DataFrame(people)

In [22]:
df2

      first    last                   email
0     Abdul  Rehman   AbdulRehman@gmail.com
1  Muhammad    Atif  MuhammadAtif@gmail.com

In [23]:
df.append(df2, ignore_index=True)

                    email    full_name     first    last
0     AliHaider@gmail.com   Ali Haider       Ali  Haider
1    TalhaAhmad@gmail.com  Talha Ahmad     Talha   Ahmad
2     TahaAhmad@gmail.com   Taha Ahmad      Taha   Ahmad
3   AbdulRehman@gmail.com          NaN     Abdul  Rehman
4  MuhammadAtif@gmail.com          NaN  Muhammad    Atif

In [24]:
df

                  email    full_name  first    last
0   AliHaider@gmail.com   Ali Haider    Ali  Haider
1  TalhaAhmad@gmail.com  Talha Ahmad  Talha   Ahmad
2   TahaAhmad@gmail.com   Taha Ahmad   Taha   Ahmad

In [25]:
df = df.append(df2, ignore_index=True)

In [26]:
df

                    email    full_name     first    last
0     AliHaider@gmail.com   Ali Haider       Ali  Haider
1    TalhaAhmad@gmail.com  Talha Ahmad     Talha   Ahmad
2     TahaAhmad@gmail.com   Taha Ahmad      Taha   Ahmad
3   AbdulRehman@gmail.com          NaN     Abdul  Rehman
4  MuhammadAtif@gmail.com          NaN  Muhammad    Atif

In [27]:
df.drop(index=4)

                   email    full_name  first    last
0    AliHaider@gmail.com   Ali Haider    Ali  Haider
1   TalhaAhmad@gmail.com  Talha Ahmad  Talha   Ahmad
2    TahaAhmad@gmail.com   Taha Ahmad   Taha   Ahmad
3  AbdulRehman@gmail.com          NaN  Abdul  Rehman

In [28]:
df

                    email    full_name     first    last
0     AliHaider@gmail.com   Ali Haider       Ali  Haider
1    TalhaAhmad@gmail.com  Talha Ahmad     Talha   Ahmad
2     TahaAhmad@gmail.com   Taha Ahmad      Taha   Ahmad
3   AbdulRehman@gmail.com          NaN     Abdul  Rehman
4  MuhammadAtif@gmail.com          NaN  Muhammad    Atif

In [30]:
df.drop(index = df[df['last']=='Ahmad'].index)

                    email   full_name     first    last
0     AliHaider@gmail.com  Ali Haider       Ali  Haider
3   AbdulRehman@gmail.com         NaN     Abdul  Rehman
4  MuhammadAtif@gmail.com         NaN  Muhammad    Atif